---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.GetRed
source: html/77705bfb-25f3-717c-8a36-2a7fd2029686.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.GetRed Method

get red

## Syntax (C#)
```csharp
public uint GetRed()
```

## Returns
red